[
    {
        "recipe_name": "Healthy gnocchi",
        "recipe_calories": 602,
        "recipe_type": "vegetarien",
        "recipe_description": "Heat the oven to 200C/fan 180C/gas 6. Put the hazelnuts in a small, rimmed baking tray. Roast for 5 minutes until the nuts are lightly toasted. Set aside to cool.Put the gnocchi, squash and onions into a large rimmed roasting tray, and drizzle with 2 tbsp of the olive oil. Toss to coat and season. Roast for 40 minutes, tossing every so often, until the gnocchi is golden and the veg has started to soften and turn golden at the edges. Remove the tray from the oven and mix in the kale. Cover with foil and return to the oven, baking for a further 5 minutes until the kale has softened.Meanwhile put the hazelnuts, basil, parsley, 30g of the parmesan and the lemon juice into a food processor and pulse to a paste. Turn the motor on and, with it still running, gradually stream in the remaining 3 tbsp of olive oil until you get a loose pesto sauce. Season to taste and pulse one last time.Add a few spoonfuls of the pesto to the tray and toss into the vegetables and gnocchi. Divide among plates and top with the remaining parmesan and pesto, and a squeeze of lemon to finish.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGtuKWAjoGCXa8HdyuFoqbfsTdJNZCMUDh5w&usqp=CAU"
    },
    {
        "recipe_name": "Tofu tacos",
        "recipe_calories": "400",
        "recipe_serving_size": "500",
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSzB9OCtGONl7CtQMjivWXd07hX55YYmZMhTQ&usqp=CAU",
        "recipe_type": "vegan",
        "recipe_description": "                                                                                     Drain the tofu and cut into 2cm cubes. Sprinkle over a little salt, and put the cubes in between pieces of kitchen paper. Put a heavy board over the top and leave to press for 30 minutes  1 hour to drain off some of the water.To make the salsa, mix all the ingredients with half the lime juice and season. Toss the cabbage with the remaining lime juice and a pinch of salt.Mix 2 tsp oil and all the spices with some seasoning in a bowl. Add the tofu pieces and toss gently to coat. Heat a non-stick frying pan and fry the pieces for 2 minutes on each side until golden and crisp. Pile into warmed tortillas or lettuce leaves and top with the salsa, cabbage and some yogurt. Serve with lime wedges for squeezing over.\n                 \n                 \n                 \n                 \n                 "
    },
    {
        "recipe_name": "broccoli fried rice",
        "recipe_calories": 415,
        "recipe_type": "vegetarien",
        "recipe_description": "Put the chopped broccoli stalk into a food processor and pulse until it is finely chopped like grains of rice. Tip out into a bowl and then repeat with the broccoli florets.Put the shallots, garlic, ginger and lemongrass in the food processor and pulse until finely chopped.Heat the sesame oil in a non-stick frying pan and fry the shallot mixture until lightly golden. Tip in the broccoli rice with 2 tbsp of water, ¾ of the chilli and all of the pepper, and fry for 5 minutes until the broccoli is cooked through and beginning to caramelise. Add in the carrot and mangetout.Mix together the soy, tamarind, sugar and the juice of two of the lime quarters, then tip this into the pan with a little seasoning. Cook for 5 minutes until the sauce is coating everything. Divide between two plates and top with the fried eggs, chopped peanuts, remaining chilli and the extra lime wedges for squeezing over..",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbUlb2N4e3loAb5Yptp6UPNJBJgMUlCIOeag&usqp=CAU"
    },
    {
        "recipe_name": "Paneer and chickpea curry",
        "recipe_calories": 600,
        "recipe_type": "vegetarien",
        "recipe_description": "Combine the curry paste and 2 tbsp of the yogurt in a bowl. Add the paneer and stir to coat. Heat the oil in a non-stick frying pan over a high heat. Cook the onion and pepper, stirring occasionally, for 3 minutes until softened. Add the paneer and chickpeas, and cook for 1 minute. Add 50ml of water, bring to a boil, then simmer for a further 2 minutes.Meanwhile, combine the remaining yogurt with the herbs, lemon juice and cumin, then season. Divide the curry between two bowls and serve with the chapatis, mint leaves and lemon wedges to squeeze over..",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRRnHGGEk-90vnF5TfTMZA3DUt1ppxQhQkAPA&usqp=CAU"
    },
    {
        "recipe_name": "Salmon traybake",
        "recipe_calories": 587,
        "recipe_type": "non-vegetarien",
        "recipe_description": "Heat the oven to 200C/fan 180C/gas 6. Tip the seeds and turmeric into a large bowl and add the vegetable oil with some seasoning. Toss the broccoli florets and stem with the oil and spices, then tip into a roasting tin with the ginger and garlic, and cook in the oven for 15 minutes.Mix together the curry paste, lime pickle and coconut milk, then pour into the tin. Nestle the salmon fillets, skin-side up, into the tin and season. Spread the tomatoes around and put back into the oven for 15-20 minutes or until the skins are starting to crisp and the salmon is cooked.Squeeze over the lime juice, sprinkle with coriander and serve with rice, if you like.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQnOlPjfxKfeCo7Q5yvelPeDUVF-cIDGssDpA&usqp=CAU"
    },
    {
        "recipe_name": "Roast chicken dinner",
        "recipe_calories": 357,
        "recipe_type": "non-vegetarien",
        "recipe_description": "Heat the oil in a large deep frying pan or casserole over a medium heat. Season the chicken thighs generously and put skin-side down in the pan with the lemon zest, thyme and potatoes.Allow the chicken thighs and potatoes to cook without moving for 10-15 minutes or until the chicken skins turn crisp and deep golden brown. Turn the chicken and potatoes, add the carrots and cook for 2-3 minutes or until the carrots are starting to become tender.Combine the chicken stock and mustard, then add to the pan. Bring to a simmer, then add the kale. Season, cover and cook for 15-20 minutes or until the chicken is cooked through, the potatoes and carrots are tender, and the liquid has reduced slightly.Serve straight to the table with a good squeeze of lemon juice and a generous sprinkling of parsley.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_ZmKvnciGVpc1n0LPzBa_rBCE6GZlNhpRGw&usqp=CAU"
    },
    {
        "recipe_name": "Chicken pasta salad",
        "recipe_calories": 339,
        "recipe_type": "non-vegetarien",
        "recipe_description": "Cook the pasta in a large pan of salted boiling water following pack instructions, then drain well. Put the oil, vinegar, Tabasco and lots of seasoning in a bowl, tip in the hot pasta and mix well. Once cooled slightly, add the red onion, tomatoes and chicken, and mix again. Chill.When ready to serve, stir through the rocket and basil, and divide between bowls..",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnzexzQtvvD9TT8n22PsV_hbaHz2y5nODK-Q&usqp=CAU"
    },
    {
        "recipe_name": "Steamed sea bass",
        "recipe_calories": 412,
        "recipe_type": "non-vegetarien",
        "recipe_description": "Heat the oven to 180C/fan 160C/gas 4. Cut two large sheets of baking paper big enough to completely fit and seal in the sea bass (about 34cm x 36cm). Put the sheets, one on top of the other, onto a large baking sheet and lay the sea bass in the middle. Scatter around the broccoli.Mix together the soy, shaoxing, sesame oil and sugar, and then pour over the fish. Open the belly of the fish and stuff with the garlic, ginger and a handful of coriander stalks. Season the fish and wrap up the parcel tightly to seal. Cook in the oven for 30-35 minutes or until the fish is coming away from the bone.Meanwhile, put the carrot and cucumber strips into a bowl with the rice vinegar and some seasoning, and toss. Leave for 20 minutes to pickle.Once the fish is cooked, open up the parcel. Top with the pickled carrot and cucumber strips, sliced red chilli and spring onions. Serve with rice..",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRf0SNVCN2gTc0XKYClcAwgm6nus77KyFWdOA&usqp=CAU"
    },
    {
        "recipe_name": "Vegan chilli",
        "recipe_calories": 350,
        "recipe_type": "vegan",
        "recipe_description": "Fry the onions, garlic and chilli in the olive oil in a casserole or heavy lidded pan for 10 minutes until softened, then add the peppers and cook for another 5 minutes.Stir in the chipotle paste, spices, oregano, tomato purée, chopped tomatoes, balsamic and stock, and bring to a simmer. Cook for 20 minutes then add the vegan mince and beans, and simmer for another 15 minutes, adding a splash of water if it gets a little thick. Season and serve with rice and a topping of diced avocado and chopped coriander, if you like.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkIPlWPlr9Pi7TG06r7qMLkpwozTA1858Ywg&usqp=CAU"
    },
    {
        "recipe_name": "Vegan enchiladas",
        "recipe_calories": 568,
        "recipe_type": "vegan",
        "recipe_description": "Heat the oil in a frying pan over a medium heat and fry the onion and peppers for 10 minutes until tender. Add the sweet potatoes, sweetcorn, beans and stock. Simmer for 15 minutes until the stock has mostly evaporated and the potatoes are tender.For the spice mixture, combine the dry spices in a small bowl with 1 tsp each of salt and black pepper. Sprinkle half over the veg mixture and cook for 1 minute, then remove from the heat.Simmer the passata with the remaining spice mixture and chipotle in a small pan over a low heat for 6-8 minutes or until saucy.Heat the oven to 200C/fan 180C/gas 6. Divide the veg filling between the wraps and roll up into fat cigars. Spoon some of the sauce into the base of a lasagne dish. Arrange the enchiladas into the dish in a single layer, pushing them against one another in a neat line, then pour over the remaining sauce. Bake for 20 minutes until bubbling and the tortillas are golden. Spoon over the yogurt and scatter with the avocado and coriander. Serve with lime wedges to squeeze over, and hot sauce, if you like.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQoLW5qKubCU2257nMLP6Hxk_6bqEHKn6Mynw&usqp=CAU"
    },
    {
        "recipe_name": "Vegan burritos",
        "recipe_calories": 496,
        "recipe_type": "vegan",
        "recipe_description": "Cook the quinoa in boiling salted water for 20-25 minutes until tender. Pour through a sieve and leave to drain thoroughly while you make the filling.Heat a drizzle of oil in a frying pan and fry the onion until soft. Add the garlic and spices and fry for another minute. Add 1 tomato, the black beans and sweetcorn and cook for 5 minutes before stirring in the drained quinoa, half the lime juice and half the coriander. Cook for a few minutes until the quinoa has warmed through.Gently mix the remaining tomato, lime juice and coriander with the avocado and chilli. Season well. Pile the quinoa mix into the middles of the wraps, top with the avocado mix. Fold in the sides, then roll up into burritos to eat. Wrap in foil and cut in half if the burritos are well stuffed and you need to keep them held together.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSKDJTEg1LQjeMtREy3NahbZwXIQAWJU6hPgA&usqp=CAU"
    },
    {
        "recipe_name": "Vegan overnight oats",
        "recipe_calories": 200,
        "recipe_type": "vegan",
        "recipe_description": "Mix together the oats, apple juice, maple syrup and raisins. Leave to soak overnight or for at least 1-2 hours.To finish, stir through the grated apple and another splash of apple juice if you want it a bit looser. Divide between bowls and top with a dollop of yogurt and a drizzle of maple syrup.",
        "recipe_serving_size": 500,
        "recipe_image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS6kYjgfrDuFuv5a4b_aGVRyAkMc1x1eHfYcw&usqp=CAU"
    }
]